EC2 ---

Storage--
  Ebs-volume
  EFS-
  S3
Memory

===================
AMI -- Os
==========
security group:act as firewall to instance
multiple security group we can add
keypair-->use logging to os --private key (.pem)

Ec2--->
 Instance Type
  AMI
  SG---
  KeyPair---We can create anytime or first we can cretae keypair
 later we attach for instance
  Volume --EBS
================================
region--it is a geographical location where aws maintence
data server
AZ-avaibilityzones
*s3-global leve; service
route 53-global level service
*Based on Ami the storage depends never say will be change
Server/Instance upgrde
os upgrade
software upgrade

*how to increase the size of volume(harddisk size)

*how to increase the ram or change of instance type there is no way to change the ram
we need to change the instance type
*SG--to have to aad maximum 5
IpAddress
====================
public--->Elastic ip--dedicated ip
private
bootstraping
===========================
bootstraping--->userdata
#!-->shebang
#!/bin/bash
touch /home/ubuntu/sheshi1
echo Today$(date) > /home/ubuntu/sheshi1
shebang
file system (directory mapping to device)
==================
how store and retrieve in os
window -->ntfs
linux ------>ext4

*To attach volume instance and volume should be same location same rgion
lsblk--to see list of attached devices in file system
/dev/xvdf 
store means mount
sudo su
mkdir d1
mount /dev/xvdf d1 (mount:map device to os)
mkfs -t ext4 /dev/xvdf(mkfs is used to create file systeminside the device)
blkid-to see file system is crested
blkid /dev/xvdf
mount /dev/xvdf d1
lsblk

Snapshot
===========
backup of Ebs volume and created at regional level
it is not possble to attach snapshot to instance
based on snapshot we can create a volume
snapshot can be copied to one region to another region
v1--AZ1 --->SNAPSHOT---->Create volume-------->AZ1/AZ2/AZ3
snapshot--
*ami--bootable snapshot we can launch instance based on ami
server performance can be 3 types
1.ram
2.processor
3.disk
voulme types--harddisk types
===============================
*5 volumes depends no of iops(input output per second)
gp2
io1--cost
sc1
st1
magantic--cheap
each and every disk depends on certain no of iops
for root volume suppoots-->gp2 io1 standard additional v
volume it can be anything
=====================
*permanent mounting and temporary mounting
fstab--device mapping
device name,directory name,device what type of file system ,mount options,is it
possible to take dump of the device,standing option
/etc/fstab
steps for permanent mounting
===================================
sudo su
cd /etc
pwd
cat fstab
lsblk -fs
vim fstab
/dev/xvdf /home/ubuntu/d1 ext4 defaults 0 0 
lsblk
mount /dev/xvdf/home/ubuntu/d1
===========
*how to display line 5
tail -n 5 /etc/passwd | head -n 1
VPC--VIRTUAL PRIVATE CLOUD
==========================
1.size of the network& address series--CIDR--
IPV4----32 Bit
IPV6 ----128 Bit
2.'router
3.nacl
4.igw
===========
I1----I1RV
I2----I2RV
  /home/ubuntu/d1---->I1RV
pwd
lsblk
touch shesai test1
stop the instance
login into 2 machine
lsblk
go to volume section dettach volume
later attach the volume to instance
mkdir dec7
ls dec7
mount /dev/xvdf1 dec7/
lsblk
cd dec7
pwd
ls
cd home/ubuntu/
pwd
ls
sudo umount /dev/xvdf1
===========================
how to login without pem key
==========
mkdir volume2
attach volume1 running instance2
lsblk
sudo mount /dev/xvdf1 server2/
cd server2
cd home/
cd ubuntu/
cd .ssh
pwd
ls
sudo su
vim authorized_keys
cd
sudo umount /dev/xvdf1
==========================
Subnet
==============
we will create only subnet in one availabilty zone and 
one  availabilty zone no of subnets(location)
*when we create subnet 5 ip's are reserved first 4 and last one
(like broadcast address,router)
*subnet always asscoiated with route table
public subnet-->subnet route having internet gateway we call public subnet
exmple
==
VPC1:
SN1(Public) i1 i2
SN2(private) i3
VPC2:
SN3(Public)---m1(23.89.90.90--10.0.0.20)
              m2(10.0.0.24)
SN4(private)---m3(34.57.89.90 10.0.0.124)
*one network  machine want to access other network machine
destination machine will be in public subnet and machine will
have public ip address
-->we will create private ip 190 and 10 and 170 series
practical
=============
1.create ubuntu ec2 instance
2.login into instance
3.switch root user
   sudo su
4.reset ubuntu user psswd
   passwd ubuntu
5.note down ubuntu userpasswd
6.goto "/etc/ssh
7.change passwordAUTHENTICATION yes in sshd_config file
passwd ubuntu
/etc/shadow
8.goto /etc/cloud dir
9.change lock_psd:False
10.save and quit
11.go to EC2 dashboard and create the image(AMI)the instance
12.launch new instance based on step11 ami without key
13.login into step12 instance"ubutu user with password"
creating a vpc(subnet which is having internet gateway is called public subnet)
========================
vpc1
192.168.0.0/24
-go to subnet and create sn1
192.168.0.0/25
-create sn2 with other availability zone
192.168.0.128//25
-make an sn1 as public
vpc cidr block default route table
go to internet gateway
go to route table and create route table and attach vpc1
edit routes
in destination 0.0.0.0/0 and target add internet gateway
-go sn1 and attach rt1 to subnet
-go to auto assign tick it
-go to ec2 launch instance and the launch the instance 
with vpc1 and sn1
-go to ec2 launch instance and the launch the instance 
with vpc1 and sn2
SN1 (Public)
 i1--(public)
 i2---(private)
SN2 (PRIVATE)
I3
intelliq---->i1
i1-->i2
i2-->i3
i3--->google.com
i3-->i1

*security group is system level(instance level)
-secutiy group is asscoicated with ec2
-allow only rules in security group
-security group is statefull
*RT is network level(network level)
*internet gateway 2 way communication
*NAT is one way communication(inside people wants to connect outside n/w)
*NAT-->Public subnet
      -elastic ip
vpc Peering:one network machine wants to coonect other network private machine
2 rules:both vpc must be in aws.
        both have must be different CIDR
IGW-->web application
NAT-->stock exchange
peering connection-->

65536--ports
0-1023--reeserved ports
>1023--ephenbiral ports
Nacl--network access control list--
nacl is associated with network level or subnet
nacl act as secutity
Nacl we can define both allow and deny rule
nacl is stateless
Vpc1-->
SNI1 (NACL1) PUBLIC-->I1(SG1)
SN2--> I2
 INTELLIQ--->(22) I1
1)NACL1 IB 22
2) SG1 IB 22
3) REQUEST WILL BE LANDED ON I1 INSTANCE
4) I1 WILL ASSIG >1024 PORT (6553)
5)NACL OB > 1024 PORT (6553)

=======================
VPC1
  SN1(public)--->I1 I2 -------->NACL1
  SN2        --->I3  -------->NACL2
Intelliq--80---i1(SG1)
anywhere--22---i1(SG1)
intelliq--22---i2(SG2)
==============================================
Intelliq--->I1(IB) --80
1.nacl1 ib 80--intell cidr
2 sg1 ib 80 --intell cidr
3 request will be landed on i1 instance
4 i1 instance will assign > 1023 port
5 nacl ob >1024
=====
 Intelliq--->I1(IB) --22(sg1)
1.nacl1 ib 22--0.0.0.0/0
2 sg1 ib 22 --0.0.0.0/0
3 request will be landed on i1 instance
4 i1 instance will assign > 1023 port
5 nacl ob >1024
======
i1---22---i2

1.sg1 ob 22
2 sg2 ib 22
===========
2.i1---22--------i3
a)i1---sg1 ob 22
b.nacl2----ob---22
c.nacl2----ib---22
d.i3---sg3 ib ---22
e.i3 will assign > 1023
f.nacl2 ob >1023
g.nacl1 ib>1023 

EFS
==========
sharing the same file between multiple ec2 instance
efs--2049
compare to ebs efs is cheaper
nfs port number 2049
IAM==user management
======================
user
group
roles
policy creation
----------------------------------------
shesai--p1 p2
sai--p1
-------
policy and permission same---->Json language
   
   Action:

   Resource:something which you create  and delete
   Effect---->Allow/Deny
   Condition
ARN
=============
address of the resource
arn contains:
arn:aws:service name:region:account :resouce type

 